{
  "History": [
    {
      "dateComplete": "2023-03-14T02:14:09.9825904",
      "completedExercise": {
        "name": "Svend Press",
        "force": "push",
        "level": "beginner",
        "mechanic": "compound",
        "equipment": "other",
        "workoutType": [
          "upper body"
        ],
        "secondaryMuscles": [
          "upper body",
          "upper body",
          "upper body"
        ],
        "instructions": [
          "Begin in a standing position.",
          "Press two lightweight plates together with your hands. Hold the plates together close to your upper body to create an isometric contraction in your upper body muscles. Your fingers should be pointed forward. This is your starting position.",
          "Squeeze the plates between your palms and extend your upper body directly out in front of you in a controlled motion.",
          "Pause at the top of the motion, and then slowly return to the starting position."
        ],
        "category": "strength"
      }
    },
    {
      "dateComplete": "2023-03-14T02:14:09.9845906",
      "completedExercise": {
        "name": "Mountain Climbers",
        "force": "pull",
        "level": "beginner",
        "mechanic": "compound",
        "equipment": "null",
        "workoutType": [
          "legs"
        ],
        "secondaryMuscles": [
          "upper body",
          "legs",
          "upper body"
        ],
        "instructions": [
          "Begin in a pushup position, with your weight supported by your hands and toes. Flexing the knee and hip, bring one leg until the knee is approximately under the hip. This will be your starting position.",
          "Explosively reverse the positions of your legs, extending the bent leg until the leg is straight and supported by the toe, and bringing the other foot up with the hip and knee flexed. Repeat in an alternating fashion for 20-30 seconds."
        ],
        "category": "plyometrics"
      }
    },
    {
      "dateComplete": "2023-03-14T02:14:09.9845906",
      "completedExercise": {
        "name": "Side Lying Groin Stretch",
        "force": "static",
        "level": "beginner",
        "mechanic": "isolation",
        "equipment": "null",
        "workoutType": [
          "legs"
        ],
        "secondaryMuscles": [
          "legs"
        ],
        "instructions": [
          "Start off by lying on your right side and bend your right knee in front of you to stabilize the torso.",
          "Rest your head on your right hand or shoulder. Lift your left leg upward and hold it by the back of the knee (easier) or the foot (harder).",
          "Pull your left knee in toward your left shoulder and simultaneously press your foot or knee down to the floor. To intensify this stretch, straighten your left leg. Switch sides."
        ],
        "category": "stretching"
      }
    }
  ]
}