{
  "History": [
    {
      "dateAdded": "2023-03-18T01:01:52.7127665",
      "sessionExercises": [
        {
          "id": "190",
          "name": "Dancer\u0027s Stretch",
          "force": "static",
          "level": "beginner",
          "mechanic": "null",
          "equipment": "null",
          "workoutType": [
            "upper body"
          ],
          "secondaryMuscles": [
            "legs",
            "legs"
          ],
          "instructions": [
            "Sit up on the floor.",
            "Cross your right leg over your left, keeping the knee bent. Your left leg is straight and down on the floor.",
            "Place your left arm on your right leg and your right hand on the floor.",
            "Rotate your upper body to the right, and hold for 10-20 seconds. Switch sides."
          ],
          "category": "stretching"
        },
        {
          "id": "55",
          "name": "Barbell Rear Delt Row",
          "force": "pull",
          "level": "beginner",
          "mechanic": "compound",
          "equipment": "barbell",
          "workoutType": [
            "upper body"
          ],
          "secondaryMuscles": [
            "upper body",
            "upper body",
            "upper body"
          ],
          "instructions": [
            "Stand up straight while holding a barbell using a wide (higher than shoulder width) and overhand (palms facing your body) grip.",
            "Bend knees slightly and bend over as you keep the natural arch of your back. Let the upper body hang in front of you as they hold the bar. Once your torso is parallel to the floor, flare the elbows out and away from your body. Tip: Your torso and your upper body should resemble the letter \"T\". Now you are ready to begin the exercise.",
            "While keeping the upper upper body perpendicular to the torso, pull the barbell up towards your upper upper body as you squeeze the rear delts and you breathe out. Tip: When performed correctly, this exercise should resemble a bench press in reverse. Also, refrain from using your upper body to do the work. Focus on targeting the rear delts; the upper body should only act as hooks.",
            "Slowly go back to the initial position as you breathe in.",
            "Repeat for the recommended amount of repetitions."
          ],
          "category": "strength"
        },
        {
          "id": "656",
          "name": "Shoulder Circles",
          "force": "pull",
          "level": "beginner",
          "mechanic": "null",
          "equipment": "null",
          "workoutType": [
            "upper body"
          ],
          "secondaryMuscles": [
            "upper body"
          ],
          "instructions": [
            "With upper body relaxed and upper body resting loosely at your sides (or in your lap if you\u0027re seated), gently roll your upper body forward, up, back, and down.",
            "Reverse direction. You can do this exercise alternating upper body or both at the same time."
          ],
          "category": "stretching"
        }
      ],
      "status": "Incomplete"
    }
  ]
}